/***********************************************************************************
 * @FIR.c
 * @说明:滤波器文件
 * @版本:V1.0
 * @作者:曹锡
 * @日期:2025.1
 * ****************************************************************************** */

/********************************** 文件包含 ************************************* */
#include "main.h"

/********************************** 外部变量 ************************************* */

/********************************** 内部变量 ************************************* */
float KK_Dynamic        = 0.5f;//一阶低通滤波系数，这里可以多设定几个系数以满足不同调用需求，函数可以根据实际情况选择系数
float KK_ChassisFellowPosition   = 0.05f;//这几个系数仅作示范
float KK_ChassisFellowSpeed    = 0.05f;

/**************** 一阶低通滤波说明 ****************
 * 一阶低通滤波的不足
 * 滤波系数越小，滤波结果越平稳，但是灵敏度较低；滤波系数越大，灵敏度越高，但是滤波结果越不稳定
 * 一阶滤波无法完美得兼顾灵敏度和平稳性。有时，我们只能寻找一个平衡，在可接受的灵敏度范围内取得尽可能好的平稳度
 * https://www.cnblogs.com/jasonchan1202/p/8393826.html
 */

/********************************** 调试变量 ************************************* */


/***********************************************************************************
 * 函   数  名: LowPass
 * 功 能 说 明: 一阶低通滤波器
 * 形      参:float *Sample_Pre [滤波当前采样值]
 *            float *OutPut_Last [上一次的输出值]
 *            char Mode [滤波系数选择]
 * 返  回  值:无
 * ****************************************************************************** */
float LowPass(float Sample_Pre,float OutPut_Last,int Mode)
{
    float a;//滤波系数
    float OutPut_Pre;//滤波输出值

    if(Mode == K_Dynamic_Calc)//根据需求调用不同的滤波系数
    {
        a=KK_Dynamic;
    }
    else if(Mode == 2)
    {
        a=KK_ChassisFellowPosition;
    }
    else if(Mode == 3)
    {
        a=KK_ChassisFellowSpeed;
    }

    OutPut_Pre = a * (Sample_Pre) + (1 - a) * (OutPut_Last);  //一阶低通滤波器

    OutPut_Last = OutPut_Pre;  //更新上一次的输出值

    return OutPut_Pre;  //返回滤波后的值
}
