//
// Created by 18796 on 2026/2/23.
//
#include "reg.h"

TYPEDEF reg ={
    /****************************************************************************
     *                              云台部分
     ****************************************************************************/
    .gimbal.pitch_pid ={
        {0.0f,0.0f,0.0f,
            20.0f,0.05f,0.0f,0.0f,0.0f,0.0f,
            0.0f,0.0f,
            6000.0f,3500.0f,0.01f,
            0.0f,0.0f,0.0f,
            0.5f,1.0f,0.0f},
        {0.0f,0.0f,0.0f,
            35.0f,0.01f,0.0f,0.0f,0.0f,0.0f,
            0.0f,0.0f,
            6000.0f,3000.0f,0.01f,
            0.0f,0.0f,0.0f,
            0.5f,1.0f,0.0f},
    },
    .gimbal.yaw_pid ={
        {0.0f,0.0f,0.0f,
            100.0f,1.0f,0.0f,0.0f,0.0f,0.0f,
            0.0f,0.0f,
            6000.0f,3500.0f,0.0f,
            0.0f,0.0f,0.0f,
            0.5f,0.5f,0.0f},
        {0.0f,0.0f,0.0f,
            10.0f,0.0f,0.0f,0.0f,0.0f,0.0f,
            0.0f,0.0f,
            6000.0f,3000.0f,0.0f,
            0.0f,0.0f,0.0f,
            0.5f,0.5f,0.0f},
        },

    .gimbal.pitch_RxData = {0,0,0,0},
    .gimbal.yaw_RxData = {0,0,0,0},

    // USB收发数据
    .gimbal.sendpacket ={0.0f,0.0f,0.0f},
    .gimbal.recvpacket ={0.0f,0.0f,0.0f},
    // 当前角度
    .gimbal.curr_angle ={0.0f,0.0f,0.0f},

    // 哨兵模式
    .gimbal.sentry_state = 0,

    .gimbal.gimbal_pitch_KF ={
        0.0f,0.0f,0.0f,0.0f,0.0f,
        0.5f,0.01f
    },
    .gimbal.gimbal_yaw_KF = {
        0.0f,0.0f,0.0f,0.0f,0.0f,
        0.5f,0.01f
    },
    /****************************************************************************
     *                              底盘部分
     ****************************************************************************/
    .chassis.yaw_pid ={
        {0.0f,0.0f,0.0f,
            0.0f,0.0f,0.0f,0.0f,0.0f,0.0f,
                0.0f,0.0f,
                0.0f,0.0f,0.0f,
                0.0f,0.0f,0.0f,
                0.0f,0.0f,0.0f},
        {0.0f,0.0f,0.0f,
            0.0f,0.0f,0.0f,0.0f,0.0f,0.0f,
                0.0f,0.0f,
                20.0f,5.0f,0.1f,
                0.0f,0.0f,0.0f,
                0.0f,0.0f,0.0f},
            },
    .chassis.Speed_X_PID = {
        {
            0.0f, 0.0f, 0.0f,
            0.0f, 0.0f, 0.0f, 0.0f, 0.0f, 0.0f,
            0.0f, 0.0f,
            0.0f, 0.0f, 0.0f,
            0.0f, 0.0f, 0.0f,
            0.0f, 0.0f, 0.0f
        },
        {
            0.0f, 0.0f, 0.0f,
            10.0f, 0.0f, 0.0f, 0.0f, 0.0f, 0.0f,
            0.0f, 0.0f,
            3500.0f, 1000.0f, 0.0f,
            0.0f, 0.0f, 0.0f,
            0.0f, 0.0f, 0.0f
        },
    },
    .chassis.Speed_Y_PID = {
        {
            0.0f, 0.0f, 0.0f,
            0.0f, 0.0f, 0.0f, 0.0f, 0.0f, 0.0f,
            0.0f, 0.0f,
            0.0f, 0.0f, 0.0f,
            0.0f, 0.0f, 0.0f,
            0.0f, 0.0f, 0.0f
        },
        {
            0.0f, 0.0f, 0.0f,
            10.0f, 0.0f, 0.0f, 0.0f, 0.0f, 0.0f,
            0.0f, 0.0f,
            3500.0f, 1000.0f, 0.0f,
            0.0f, 0.0f, 0.0f,
            0.0f, 0.0f, 0.0f
        },
    },
    .chassis.Speed_X_KF ={
        0.0f,0.0f,0.0f,0.0f,0.0f,
        0.5f,0.01f
    },
    .chassis.Speed_Y_KF ={
        0.0f,0.0f,0.0f,0.0f,0.0f,
        0.5f,0.01f
    },

    // 底盘绝对坐标系下的目标速度
    .chassis.inverse_speed_X = 0.0f,
    .chassis.inverse_speed_Y = 0.0f,
    .chassis.forward_speed_X = 0.0f,
    .chassis.forward_speed_Y = 0.0f,
    .chassis.target_omega = 0.0f,
    .chassis.actual_omega = 0.0f,
    // 底盘四个电机的返回速度
    .chassis.Motor_1_RxData = {0,0,0,0},
    .chassis.Motor_2_RxData = {0,0,0,0},
    .chassis.Motor_3_RxData = {0,0,0,0},
    .chassis.Motor_4_RxData = {0,0,0,0},

    /****************************************************************************
     *                              CAN + RC
     ****************************************************************************/
    // CAN通信
    .TxData = {0,0,0,0},
    // CAN中间量
    //.MData = {0},
    //遥控器
    .rc_Data = {
        .rc = {0,0,0,0,
                0,0},
        .mouse = {0,0,0,
                0,0},
        .key = {0},
    },

    .speed_cal = {0},
    /****************************************************************************
     *                              BMI088
     ****************************************************************************/
    .gyro_bias = {0.0f},
    .accel_bias = {0.0f},

    .exti_bmi_data = {0},
    .bmi_flag = 0,

    .bmi088_real_data = {
    0,{0.0f,0.0f,0.0f},
    0,{0.0f,0.0f,0.0f},
    0,
    },
    .gyro_int_status = 0,
    .accel_int_status = 0,
    .bmi088_selftest_status = 0,
};

TYPEDEF *p_reg = &reg;